In [1]:
import pandas as pd
data={"name":["sapna","vikash","sagar","ram","krishna"],
      "age":[20,22,23,45,67],
      "sallary":[40000,70000,50000,50000,30000]}
df=pd.DataFrame(data)
print(df)

      name  age  sallary
0    sapna   20    40000
1   vikash   22    70000
2    sagar   23    50000
3      ram   45    50000
4  krishna   67    30000

In [2]:
data=pd.read_csv("sixth.csv")
print(data)

      name village
0      ram     abc
1     sita      nm
2  krishna     ght

In [3]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     3 non-null      object
 1   village  3 non-null      object
dtypes: object(2)
memory usage: 180.0+ bytes
None

In [15]:
import pandas as pd
data=pd.read_excel("Book1.xlsx")
print(data)

       name  age  sallary  designation       city  gender
0     sapna   21    20000     engineer      bihar  female
1    vikash   22    80000  programmmer         mp    male
2   krishna   32    30000       cahier         up    male
3     sagar   23     4000       tester  jharkhand    male
4    nandni   25     2000      manager      delhi  female
5     ragni   34     7000        coder     mumbai  female
6    pushpa   33     9000   programmer    kolkata  female
7      rani   44    10000      manager      rachi  female
8     shyam   40    11000      manager       pune    male
9     mohan   30     3300       cahier   banglore    male
10   rakesh   31     5500     engineer      patna    male
11    meena   41     3500     engineer     jaipur  female
12  sanjeev   42     4500       tester      delhi    male
13    mohit   37    50000      teacher         mp    male
14      ram   29    40000      teacher         up    male
15    radha   28    70000       cahier      delhi  female
16    seeta   38    44000     engineer     mumbai  female
17   rakesh   35    45000       tester     jaipur    male
18    pooja   27    29000        coder      delhi  female

In [13]:
import pandas as pd
data=pd.read_csv("employee.csv")
print(data)

       name  age  sallary  designation       city  gender  bonus
0     sapna   21    20000     engineer      bihar  female      3
1    vikash   22    80000  programmmer         mp    male      6
2   krishna   32    30000       cahier         up    male      8
3     sagar   23     4000       tester  jharkhand    male      5
4    nandni   25     2000      manager      delhi  female      8
5     ragni   34     7000        coder     mumbai  female      9
6    pushpa   33     9000   programmer    kolkata  female      5
7      rani   44    10000      manager      rachi  female      6
8     shyam   40    11000      manager       pune    male      7
9     mohan   30     3300       cahier   banglore    male      6
10   rakesh   31     5500     engineer      patna    male      7
11    meena   41     3500     engineer     jaipur  female      6
12  sanjeev   42     4500       tester      delhi    male      6
13    mohit   37    50000      teacher         mp    male      7
14      ram   29    40000      teacher         up    male      5
15    radha   28    70000       cahier      delhi  female      8
16    seeta   38    44000     engineer     mumbai  female      5
17   rakesh   35    45000       tester     jaipur    male      4
18    pooja   27    29000        coder      delhi  female      8

In [20]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         19 non-null     object
 1   age          19 non-null     int64
 2   sallary      19 non-null     int64
 3   designation  19 non-null     object
 4   city         19 non-null     object
 5   gender       19 non-null     object
dtypes: int64(2), object(4)
memory usage: 1.0+ KB
None

In [21]:
data.describe()

             age       sallary
count  19.000000     19.000000
mean   32.210526  24621.052632
std     6.948852  24070.396270
min    21.000000   2000.000000
25%    27.500000   5000.000000
50%    32.000000  11000.000000
75%    37.500000  42000.000000
max    44.000000  80000.000000

In [22]:
print(data.isnull())

     name    age  sallary  designation   city  gender
0   False  False    False        False  False   False
1   False  False    False        False  False   False
2   False  False    False        False  False   False
3   False  False    False        False  False   False
4   False  False    False        False  False   False
5   False  False    False        False  False   False
6   False  False    False        False  False   False
7   False  False    False        False  False   False
8   False  False    False        False  False   False
9   False  False    False        False  False   False
10  False  False    False        False  False   False
11  False  False    False        False  False   False
12  False  False    False        False  False   False
13  False  False    False        False  False   False
14  False  False    False        False  False   False
15  False  False    False        False  False   False
16  False  False    False        False  False   False
17  False  False    False        False  False   False
18  False  False    False        False  False   False

In [23]:
print(data.isnull().sum())

name           0
age            0
sallary        0
designation    0
city           0
gender         0
dtype: int64